Revit 2027 API
PipeSettings.GetPipeSlopes Method
 Get pipe slopes.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetPipeSlopes()
Public Function GetPipeSlopes As IList(Of Double)
public:
IList<double>^ GetPipeSlopes()
member GetPipeSlopes : unit -> IList<float>
Return Value
IList<Double>
 Pipe slope values. Revit stores the slope value as a percentage (0-100).
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace